<?php
/*
 * Написать функцию, по заданному числу формирующее текстовое окончание по правилам русского языка
 * Главный критерий, возможность легко менять слова, например яблок, яблока, яблоко
 * пример окончаний для часов-минут
0 часов	минут	10 часов минут 20 часов минут	30 минут  40 минут
1 час	минута	11 часов минут 21 час	минута	31 минута 41 минута
2 часа	минуты	12 часов минут 22 часа	минуты	32 минуты 42 минуты
3 часа	минуты	13 часов минут 23 часа	минуты	33 минуты 43 минуты
4 часа	минуты	14 часов минут 24 часа	минуты	34 минуты 44 минуты
5 часов	минут	15 часов минут 25		минут	35 минут  45 минут
6 часов	минут	16 часов минут 26		минут	36 минут  46 минут
7 часов минут	17 часов минут 27		минут	37 минут  47 минут
8 часов	минут	18 часов минут 28		минут	38 минут  48 минут
9 часов минут	19 часов минут 29		минут	39 минут  49 минут

* вызовите функцию в цикле для чисел от 0 до 50 с яблоками
 */


//Попробовал сделать, чтобы работало с любым количеством
$word = "Яблоко";
$max = 100;

for ($i = 0; $i <= $max; $i++) {
	$nomСase = $i % 10 === 1;
	$genCaseSingular = in_array($i % 10, array(2, 3, 4));
	$genCasePlural = in_array($i % 10, range(5, 9)) || in_array($i % 100, range(10, 19)) || $i % 10 === 0;

	if ($genCasePlural) {
		echo $i . ' ' . mb_substr($word, 0, -1) . '<br>';
	} elseif ($genCaseSingular) {
		echo $i . ' ' . mb_substr($word, 0, -1) . "a" . '<br>';
	} elseif ($nomСase) {
		echo $i . ' ' . mb_substr($word, 0, -1) . "о" .  '<br>';
	}
}
